app/controllers/home_controller.rb

SELECT "stories".* FROM "stories" LIMIT 8 OFFSET 0
---
  def index
    @stories = Story.paginate(:page => params[:page], :per_page => 8)