app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'jeff' AND "users"."password_digest" = '55555' LIMIT 1
---
  def create
    @user = User.find_by_username_and_password_digest(params[:username], params[:password])