app/controllers/stories_controller.rb

  def show
    @story = Story.find(params[:id])
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @story = Story.find(params[:id])
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @story = Story.new(params[:story])

    respond_to do |format|
      if @story.save
---
INSERT INTO "stories" ("created_at", "location", "story_date", "story_entry", "story_photo_url", "story_time", "travel_image_content_type", "travel_image_file_name", "travel_image_file_size", "travel_image_updated_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)